import img from '../../Images/SHTORIPVH1.jpg';
import img1 from '../../Images/SHTORIPVH2.jpg';
import img2 from '../../Images/SHTORIPVH3.jpg';
import imgCar from '../../Images/TENTCAR1.jpeg';
import img1Car from '../../Images/TENTCAR2.jpg';
import img2Car from '../../Images/TENTCAR3.jpg';
import imgSand from '../../Images/TENTPESOK1.jpg';
import img1Sand from '../../Images/TENTPESOK2.jpg';
import img2Sand from '../../Images/TENTPESOK3.jpg';

export const configProductDescription = [
  {
    id: 1,
    title: 'Штори ПВХ для тераси, бесідки, веранди',
    images: [img, img1, img2],
    installation: '?',
    coast: '?',
    square: '?',
    mainText:
      'Захист від погодних умов: Штори з ПВХ забезпечують надійний захист від вітру, дощу та снігу, що дозволяє використовувати відкриті простори навіть у негоду.',
    description: `
    <p>Штори з ПВХ (полівінілхлориду) ідеально підходять для захисту вашої тераси, бесідки або веранди від вітру, дощу та снігу, забезпечуючи затишок і комфорт в будь-яку пору року. Вони виготовлені з високоякісного матеріалу, який відрізняється високою міцністю, довговічністю та стійкістю до ультрафіолетового випромінювання. Прозорі або кольорові штори не тільки захищають від несприятливих погодних умов, але й дозволяють зберегти природне освітлення та створити приємну атмосферу.</p>
  `,
    benefits: `
    <p><strong>Прозорість та світлопроникність:</strong> Прозорі штори зберігають природне освітлення, забезпечуючи комфортне перебування на терасі або веранді.</p>
    <p><strong>Стійкість до ультрафіолету:</strong> Матеріал не вигоряє на сонці, зберігаючи свій первісний вигляд на довгий час.</p>
    <p><strong>Довговічність:</strong> Штори з ПВХ витримують механічні навантаження, не деформуються і не тріскаються при низьких температурах.</p>
    <p><strong>Легкий догляд:</strong> Матеріал легко миється і не вимагає спеціального догляду.</p>
    <p><strong>Простота монтажу:</strong> Штори легко встановлюються і можуть бути швидко демонтовані, коли вони не потрібні.</p>
  `,
    usage: `
    <p><strong>Де можна використовувати:</strong></p>
    <ul>
      <li><strong>Тераси:</strong> Захист від негоди та збереження комфорту на відкритих майданчиках.</li>
      <li><strong>Бесіди:</strong> Створення затишної атмосфери для відпочинку та зустрічей.</li>
      <li><strong>Веранди:</strong> Збереження тепла та захист від зовнішніх факторів, дозволяючи насолоджуватися відпочинком у будь-яку погоду.</li>
    </ul>
  `,
    designOptions: `
    <p><strong>Варіанти дизайну:</strong> Штори з ПВХ доступні в різних кольорах і дизайнах, що дозволяє вибрати оптимальний варіант для вашого екстер'єру. Вони можуть бути як повністю прозорими, так і з різними рівнями затемнення, що дозволяє регулювати ступінь проникнення світла та зберігати приватність.</p>
  `,
    cta: `
    <p>Замовляючи штори з ПВХ для вашої тераси, бесідки або веранди, ви отримуєте не тільки захист, але і можливість створити затишний куточок для відпочинку, незалежно від погоди за вікном.</p>
    <p>Детальніше дізнатися про штори з ПВХ і замовити їх можна на НАШОМУ САЙТІ</p>
  `,
  },
  {
    id: 2,
    title: 'Тенти на пісочниці',
    images: [imgSand, img1Sand, img2Sand],
    installation: '1 день',
    coast: 'від 750грн',
    square: '1м²',
    mainText:
      'Захист від Дощу і Бруду: Водонепроникні матеріали тентів запобігають намоканню піску та потраплянню в пісочницю бруду, листя і дрібних сміттєвих часток.',
    description: `
      <p>Тенти для пісочниць — це незамінний елемент для створення безпечних і комфортних умов ігор для дітей на відкритому повітрі. Вони ефективно захищають пісочниці від сонця, дощу і бруду, дозволяючи дітям насолоджуватися грою в будь-яку погоду. Виготовлені з міцних та стійких матеріалів, тенти забезпечують тривалий захист і легкість в експлуатації.</p>
    `,
    benefits: `
      <p><strong>Основні Переваги Тентів для Пісочниць</strong></p>
      <p><strong>Захист від Ультрафіолету:</strong> Тенти забезпечують надійний захист від шкідливого ультрафіолетового випромінювання, зменшуючи ризик отримання сонячних опіків під час гри на свіжому повітрі.</p>
      <p><strong>Підвищення Комфорту:</strong> Завдяки тентам пісочниця залишається прохолодною в спекотні дні, створюючи комфортні умови для гри.</p>
      <p><strong>Довговічність та Міцність:</strong> Тенти виготовляються з високоякісних матеріалів, які витримують різні погодні умови та служать протягом багатьох років.</p>
      <p><strong>Легкий Монтаж і Демонтаж:</strong> Тенти легко встановлюються та знімаються, дозволяючи швидко змінювати захист залежно від потреб.</p>
      <p><strong>Естетичний Дизайн:</strong> Різноманітні кольори і форми дозволяють вибрати тент, який ідеально впишеться в дизайн вашого саду або дитячого майданчика.</p>
    `,
    usage: `
      <p><strong>Де і Як Використовувати Тенти для Пісочниць</strong></p>
      <p><strong>Приватні Дворики:</strong> Захистіть пісочниці у вашому дворі від сонця та дощу, забезпечивши комфортні умови для гри дітей.</p>
      <p><strong>Дитячі Майданчики:</strong> Створіть безпечні ігрові зони на громадських майданчиках, використовуючи тенти для пісочниць.</p>
      <p><strong>Дитячі Сади:</strong> Забезпечте захист дітей від шкідливого ультрафіолету та інших погодних умов на території дитячих садків.</p>
    `,
    designOptions: `
      <p><strong>Типи та Матеріали Тентів</strong></p>
      <p><strong>Поліпропіленові Тенти:</strong> Легкі та міцні, стійкі до ультрафіолетового випромінювання і водонепроникні.</p>
      <p><strong>Тенти з ПВХ:</strong> Забезпечують максимальний захист від води та ультрафіолету, легко очищаються і довго служать.</p>
      <p><strong>Парусинові Тенти:</strong> Виготовлені з натуральних матеріалів, вони забезпечують захист від сонця і легко кріпляться.</p>
    `,
    cta: `
      <p><strong>Вибір Тенту для Вашої Пісочниці</strong></p>
      <p>При виборі тенту для пісочниці враховуйте розмір і форму пісочниці, а також кліматичні умови у вашому регіоні. Деякі моделі можуть бути оснащені додатковими елементами, такими як захисні екрани від комах або можливість регулювання висоти.</p>
      <p>Замовити тенти для пісочниць ви можете на нашому САЙТІ. Обирайте найкращий захист для ваших дітей!</p>
    `,
  },
  {
    id: 3,
    title: 'Тенти для Причепів та Автомобілів',
    images: [imgCar, img1Car, img2Car],
    installation: '?',
    coast: 'від 1800грн',
    square: '?',
    mainText:
      'Тенти забезпечують надійний захист від дощу, снігу, сонячного випромінювання та вітру, допомагаючи зберегти транспорт і вантаж у відмінному стані.',
    description: `
      <p>Тенти для причепів та автомобілів — це надійне рішення для захисту вашого транспорту і вантажу від погодних умов, пилу та бруду. Виготовлені з міцних та водонепроникних матеріалів, вони забезпечують ефективний захист і довгий термін служби. Тенти легко встановлюються і можуть бути підібрані за розміром та формою, що робить їх ідеальними для різних типів транспорту.</p>
    `,
    benefits: `
      <p><strong>Основні Переваги Тентів для Причепів та Автомобілів</strong></p>
      <p><strong>Водонепроникність:</strong> Використання високоякісних водонепроникних матеріалів гарантує, що ваш вантаж залишиться сухим навіть у найсильніший дощ.</p>
      <p><strong>Захист від Пилу та Бруду:</strong> Тенти допомагають захистити транспорт від пилу, бруду та інших забруднень, зберігаючи його зовнішній вигляд чистим і доглянутим.</p>
      <p><strong>Універсальність:</strong> Тенти можуть бути використані для різних типів транспорту, включаючи легкові та вантажні автомобілі, причепи, фургони та інші транспортні засоби.</p>
      <p><strong>Простота Установки:</strong> Тенти легко встановлюються за допомогою спеціальних кріплень або натяжних систем, що дозволяє швидко і без зусиль закріпити їх на транспорті.</p>
      <p><strong>Довговічність:</strong> Високоякісні матеріали, стійкі до ультрафіолету і механічних пошкоджень, забезпечують тривалий термін експлуатації тентів.</p>
      <p><strong>Індивідуальні Розміри:</strong> Можливість виготовлення тентів на замовлення під конкретні розміри і форми вашого транспорту, що гарантує ідеальну посадку і надійний захист.</p>
    `,
    usage: `
      <p><strong>Типи Тентів для Причепів та Автомобілів</strong></p>
      <p><strong>Поліпропіленові Тенти:</strong> Легкі та міцні, вони забезпечують захист від вологи і ультрафіолетового випромінювання. Ідеально підходять для легких вантажів та автомобілів.</p>
      <p><strong>ПВХ Тенти:</strong> Надійні та водонепроникні, вони забезпечують максимальний захист від погодних умов. Відмінний вибір для вантажних автомобілів та причепів.</p>
      <p><strong>Брезентові Тенти:</strong> Виготовлені з натуральних матеріалів, ці тенти забезпечують хорошу вентиляцію та стійкість до різних механічних впливів.</p>
    `,
    designOptions: `
      <p><strong>Вибір Тенту для Вашого Транспорту</strong></p>
      <p>При виборі тенту для причепів або автомобілів слід враховувати такі фактори:</p>
      <p><strong>Розмір і форма транспорту:</strong> Тент має відповідати розмірам та формі вашого автомобіля або причепу для забезпечення надійного захисту.</p>
      <p><strong>Кліматичні умови:</strong> Вибирайте матеріали, які найбільш підходять для клімату у вашому регіоні.</p>
      <p><strong>Тип вантажу:</strong> Якщо ви перевозите чутливий до вологи або пилу вантаж, вибирайте тенти з максимальним рівнем захисту.</p>
    `,
    cta: `
      <p>Ви можете замовити тенти для причепів та автомобілів різних розмірів та конфігурацій на нашому САЙТІ. Пропонуємо широкий вибір якісних тентів за доступними цінами з доставкою по всій країні.</p>
    `,
  },
];
