import { useState } from 'react';
import {
  FaqSectionConteiner,
  FaqSectionItem,
  FaqSectionList,
  ItemBlock,
  ItemText,
  MainTextFaqSection,
  Minus,
  Plus,
  TextFaqSection,
  TextHoverFaqSection,
} from './FaqSection.styled';

export const FaqSection = () => {
  const [isFaqOpen, setIsFaqOpen] = useState(null);

  const toggleFaqList = item => {
    setIsFaqOpen(item);
  };

  return (
    <FaqSectionConteiner>
      <MainTextFaqSection>Запитання та відповіді</MainTextFaqSection>
      <TextFaqSection>
        Ось список найпопулярніших запитань, щоб познайомитись краще
      </TextFaqSection>
      <FaqSectionList>
        <FaqSectionItem>
          <ItemBlock>
            <ItemText>
              Як швидко приходить відповідь на заявку по дзвінку?
            </ItemText>
            {isFaqOpen ? (
              <Minus onClick={() => toggleFaqList(null)} />
            ) : (
              <Plus onClick={() => toggleFaqList(1)} />
            )}
          </ItemBlock>
          {isFaqOpen === 1 ? (
            <TextHoverFaqSection>
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові.{' '}
            </TextHoverFaqSection>
          ) : (
            <></>
          )}
        </FaqSectionItem>
        <FaqSectionItem>
          <ItemBlock>
            <ItemText>
              Як швидко приходить відповідь на заявку по дзвінку?
            </ItemText>
            {isFaqOpen === 2 ? (
              <Minus onClick={() => toggleFaqList(null)} />
            ) : (
              <Plus onClick={() => toggleFaqList(2)} />
            )}
          </ItemBlock>
          {isFaqOpen === 2 ? (
            <TextHoverFaqSection>
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові.{' '}
            </TextHoverFaqSection>
          ) : (
            <></>
          )}
        </FaqSectionItem>
        <FaqSectionItem>
          <ItemBlock>
            <ItemText>
              Як швидко приходить відповідь на заявку по дзвінку?
            </ItemText>
            {isFaqOpen === 3 ? (
              <Minus onClick={() => toggleFaqList(null)} />
            ) : (
              <Plus onClick={() => toggleFaqList(3)} />
            )}
          </ItemBlock>
          {isFaqOpen === 3 ? (
            <TextHoverFaqSection>
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові.{' '}
            </TextHoverFaqSection>
          ) : (
            <></>
          )}
        </FaqSectionItem>
        <FaqSectionItem>
          <ItemBlock>
            <ItemText>
              Як швидко приходить відповідь на заявку по дзвінку?
            </ItemText>
            {isFaqOpen === 4 ? (
              <Minus onClick={() => toggleFaqList(null)} />
            ) : (
              <Plus onClick={() => toggleFaqList(4)} />
            )}
          </ItemBlock>
          {isFaqOpen === 4 ? (
            <TextHoverFaqSection>
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові.{' '}
            </TextHoverFaqSection>
          ) : (
            <></>
          )}
        </FaqSectionItem>
        <FaqSectionItem>
          <ItemBlock>
            <ItemText>
              Як швидко приходить відповідь на заявку по дзвінку?
            </ItemText>
            {isFaqOpen === 5 ? (
              <Minus onClick={() => toggleFaqList(null)} />
            ) : (
              <Plus onClick={() => toggleFaqList(5)} />
            )}
          </ItemBlock>
          {isFaqOpen === 5 ? (
            <TextHoverFaqSection>
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо
              тенти, тенти тентові. Робимо тенти, тенти тентові. Робимо тенти,
              тенти тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти
              тентові. Робимо тенти, тенти тентові. Робимо тенти, тенти тентові.
              Робимо тенти, тенти тентові.{' '}
            </TextHoverFaqSection>
          ) : (
            <></>
          )}
        </FaqSectionItem>
      </FaqSectionList>
    </FaqSectionConteiner>
  );
};
